import principal_image from "@/assets/principal.jpg";
import banner from "@/assets/banner.jpg";

export enum NavigationLinks {
    home = "হোম পেজ",
    about = "আমাদের সম্পর্কে",
    notice = "Notice",
    result = "রেজাল্ট",
    campus = "Campus",
    routine = "Routine",
    contact = "Contact",
}

export const about_us_links = [
    {
        title: "আমাদের প্রত্যাশা ও পদক্ষেপ",
        href: "/আমাদের-প্রত্যাশা-ও-পদক্ষেপ",
        description: "",
    },
    {
        title: "অবকাঠামো",
        href: "/অবকাঠামো",
        description: "",
    },
    {
        title: "কর্মরত শিক্ষক কর্মকর্তা ও কর্মচারীদের নামের তালিকা",
        href: "/কর্মরত-শিক্ষক-কর্মকর্তা-ও-কর্মচারীদের-নামের-তালিকা",
        description: "",
    },
    {
        title: "শিক্ষার্থীদের জন্য নিয়ম-কানুন",
        href: "/শিক্ষার্থীদের-জন্য-নিয়ম-কানুন",
        description: "",
    },
    {
        title: "শিক্ষক সংসদ",
        href: "/শিক্ষক-সংসদ",
        description: "",
    },
    {
        title: "কলেজের ইতিহাস",
        href: "/history",
        description: "",
    },
    {
        title: "সুবিধা",
        href: "/সুবিধা",
        description: "",
    },
];

export const notice_links = [
    {
        title: "কলেজ নোটিশ",
        href: "/notice/কলেজ-নোটিশ",
        description:
            "Stay updated with the latest announcements and notices from colleges.",
    },
    {
        title: "এইচ এস সি নোটিশ",
        href: "/notice/এইচ-এস-সি-নোটিশ",
        description:
            "Receive notifications regarding HSC (Higher Secondary Certificate) information, results, seat plans, and more.",
    },
    {
        title: "NU নোটিশ",
        href: "/notice/NU-নোটিশ",
        description:
            "Access National University notices and announcements through this platform.",
    },
];

export type NoticeType = "কলেজ-নোটিশ" | "এইচ-এস-সি-নোটিশ" | "NU-নোটিশ";

export const result_links = [
    {
        title: "কলেজ রেজাল্ট",
        href: "/কলেজ-রেজাল্ট",
        description: "কলেজের সেমিস্টার রেজাল্ট পোর্টাল",
    },
    {
        title: "এইচ এস সি রেজাল্ট",
        href: "/এইচ-এস-সি-রেজাল্ট",
        description: "অত্র বৎসরের এইচ এস সি রেজাল্ট",
    },
    {
        title: "ডিগ্রি / অনার্স রেজাল্ট",
        href: "/ডিগ্রি-রেজাল্ট",
        description: "National University result page",
    },
];

export const principle_speech_json = {
    name: "প্রফেসর মোঃ আবদুর রউফ",
    position: "অধ্যক্ষ",
    imageSrc: principal_image.src,
    message:
        "অধ্যক্ষের পরিচিতি,প্রফেসর মোঃ আবদুর রউফ (আইডি নং-০০০০৭৬৯৮) অধ্যক্ষ,সরকারি নাজমুল স্মৃতি কলেজ, শিক্ষাগত যোগ্যতাঃ আলিম-১ম বিভাগ-১৯৮৩ (এসএসসি সমমান), ফাজিল-১ম বিভাগ-১৯৮৫ (এইচএসসি সমমান), বিবিএস সম্মান-২য় শ্রেণি-১৯৮৮, এমবিএস (ব্যবস্থাপনা)-২য় শ্রেণি-১৯৮৯, ইসলামী বিশ্ববিদ্যালয়। ১৪’শ বিসিএস (সাধারণ শিক্ষা) এর মাধ্যমে ২০/১১/১৯৯৩ইং তারিখে সরকারি কিয়ামত উল্লাহ কলেজ, বকশীগঞ্জ, জামালপুর এ তাঁর কর্ম জীবন শুরু হয়। পরবর্তীতে পদোন্নতি পেয়ে সরকারি আযিযুল হক কলেজ, বগুড়া ও সরকারি আনন্দ মোহন কলেজ, ময়মনসিংহ এবং শেরপুর সরকারি কলেজে ব্যবস্থপনা বিভাগে কর্মরত ছিলেন। তিনি বিগত ০১/০১/২০২০ইং তারিখ থেকে সরকারি নাজমুল স্মৃতি কলেজে অধ্যক্ষ হিসেবে কর্মরত আছেন। নায়েমে বুনিয়াদী প্রশিক্ষণ ও এ সি ই এম কোর্স, চট্টগ্রাম বিশ্ববিদ্যালয়ে সামার সায়েন্স কোর্স, জাতীয় বিশ্ববিদ্যালয়ে উচ্চতর প্রশিক্ষণ কোর্স, ঢাকা টিটি কলেজে সৃজনশীল মাস্টার ট্রেইনার কোর্সের প্রশিক্ষণ গ্রহণ করেন। তিনি ব্যবসায় সংগঠন ও ব্যবস্থাপনা ১ম ও ২য় পত্র বইয়ের একজন প্রণেতা। জাতীয় শিক্ষাসপ্তাহ-২০২২ এ উপজেলা ও জেলা পর্যায়ে শ্রেষ্ঠ অধ্যক্ষ (কলেজ) নির্বাচিত হন। জাতীয় শিক্ষাসপ্তাহ-২০২৩ এ উপজেলা পর্যায়ে, জেলা পর্যায়ে এবং ময়মনসিংহ বিভাগে শ্রেষ্ঠ অধ্যক্ষ (কলেজ) নির্বাচিত হন।",
    link: "/speech/principal",
};

export const college_history_json = {
    name: "কলেজের ইতিহাস",
    imageSrc: banner.src,
    message:
        "ভোগাই নদীর ধূসর জলস্রােতের স্বর্ণোজ্জল বালির চেতনাবোধে জাগরিত নালিতাবাড়ী উপজেলার সবুজ নলিতা শাখার মৃত হলুদপত্র আচ্ছাদিত ঊর্বর ভূমির মায়াবী আচঁলে গারো, কোঁচ, ডালু, হদি, হাজং, হিন্দু ও মুসলমান জাতির বসবাস শেরপুর জেলার এই পাহাড়ী অঞ্চলে। বিভিন্ন উপজাতি সমৃদ্ধ এ এলকায় তৎকালীন এম,এন,এ ও এম,এল, এ জনাব আব্দুল হাকিম সরকার ১৯৬৬ সনের জুন মাসে নকলা থানার অধিবাসী জামালি সাহেব (Health Assistent) কে সাথে নিয়ে স্থানীয় ইউনিয়ন পরিষদ গৃহে কলেজ প্রতিষ্ঠার সর্বপ্রথম আলোচনার সূত্রপাত করনে। এ আলোচনা সভার পরই কলেজ প্রতিষ্ঠার নিমিত্তে অর্থ সংগ্রহে বেরিয়ে পড়েন বরুয়াজানীর মাতুলালয়ে জন্ম গ্রহনকারী বাংলাদেশ কৃষি বিশ্ববিদ্যালয়ের ত্যাজোদ্বীপ্ত মেধাবী ও সংগ্রামী ছাত্রনেতা ভি. পি নাজমুল আহসান। নালিতাবাড়ীতে উচ্চ শিক্ষার দ্বার উন্মোচনের লক্ষ্যে আব্দুল হাকিম সরকার সাহেবের নেতৃত্বে আব্দুর রশিদ, নগেন্দ্র চন্দ্র পাল, আব্দুল করিম, আবু মোহাম্মদ নুরুল হক, মেহের আলী সরকার, আব্দুল মতিন মাস্টার, আব্দুর রহমান সরকার, ইউসুফ আলী সরকার, মোহাম্মদ আলী মেম্বার, ডা. আব্দুল হামিদ, অধ্যাপক এনায়েত আলী, আব্দুর রাজ্জাক, সেকান্দর আলী তালুকদার, মুক্তিযোদ্ধা আক্তারুজ্জামান, অধ্যাপক প্রভাত চন্দ্র পাল, অধ্যাপক সুনীর চন্দ্সাহা, ধীরেন্দ্র চন্দ্র সরকার, আব্দুল লতিফ, রাম সংকর কালোয়ার, নিবারন ভৌমিক, মুক্তিযোদ্ধা আবুল হাসেম, আফতাব উদ্দিন সরকার, ইন্দ্রভূষণ রায়, আবুল কাসেম তালুকদার চয়ারম্যান, নুর হোসেন চেয়ারম্যান, হাবিব উল্লাহ মিয়া সহ স্থানীয় গণমান্য ব্যক্তিবর্গ ও সর্বসাধারণের সম্পৃক্ততায় নালিতাবাড়ী উপজেলায় পৌরসভার প্রাণ কেন্দ্রে ১৯৭১ সনে স্বাধীনতা যুদ্ধে জীবন উৎসর্গকারী মুক্তিযোদ্ধা শহীদ নাজমুল আহসানের স্মৃতি রক্ষার্থে ১৯৭২ সনে প্রতিষ্ঠা করা হয় “নাজমুল স্মৃতি মাহবিদ্যালয়”। কলেজ প্রতিষ্ঠার শুরুতে অভিনাষ চন্দ্র রায় ও শ্রী ভুপতি মোহন রায় চৌধুরী গং গোবিন্দনগর কালিনগর মৌজায় ৮.৩২ একর জমি দান করেন। প্রতিষ্ঠালগ্নে নালিতাবাড়ীর মুক্তিযোদ্ধের অন্যতম সংগঠক ও মুক্তিযোদ্ধা আবু তাহের সাহেব প্রতিষ্ঠাতা অধ্যক্ষ হিসেবে দায়িত্ব গ্রহণ করেন। একাদশ শ্রেণির মানবিক, বিজ্ঞান, ও বাণিজ্য শাখা নিয়ে অত্র “ নাজমুল স্মৃতি মহাবিদ্যালয়” এর যাত্র শুরু হয়। পরবর্তীতে ১৯৮৮ সনে স্মাতক মানবিক, ১৯৯৫ সনে বিজ্ঞান এবং ২০০৪ সনে বাণিজ্য শাখা চালু করে পূর্ণাঙ্গ ডিগ্রি কলেজে রূপান্তরিত হয়। তারপর ২০০৫ সনে (বিএম) কোর্স চালু হয় এবং জাতীয় বিশ্ববিদ্যালয়ের অধিনে ২০১৩ সনে রাষ্ট্রবিজ্ঞান ও সমাজকর্ম বিষয়ে অনার্স কোর্স এবং ২০১৪ সনে বাংলা বিষয়ে অনার্স কোর্স চালু হয়। সকল শাখা ও বিভাগ মিলিয়ে বর্তমানে কলেজের শিক্ষার্থী সংখ্যা পায় ৩২০০। কলেজের একটি সুবিশাল মাঠ সহ ৮.৩২( আট একর বত্রিশ শতাংশ) একর জমি রয়েছে। ২০১৭ সালে শহীদ নাজমুল আহসান এর মরনোত্তর স্বাধীনতা পদক প্রাপ্তির মধ্য দিয়ে জেলার অন্যান্য উপজেলা থেকে নালিতাবাড়ীকে দিয়েছে স্বতন্ত্র সম্মান।",
    link: "/history",
};

export const NUMBER_OF_ROWS = 10;
export const college_name = "সরকারি নাজমুল স্মৃতি মহাবিদ্যালয়";
